#-------------------------------------------------------------------------------------------
#ПОЛЕЗНЫЕ МЕТОДЫ
#-------------------------------------------------------------------------------------------
#data.describe(include=[типы данных]) предоставляет стандартные расчетные значения по датафрейму
#data.head(10) первые 10 строк датафрейма
#data.tail(3) последние 3 строки датафрейма
#data.info() основные данные по датафрейму
#type(data['Pclass']) тип объекта
#min(data2['Height (m)']) минимальное значение столбца
#del data['nameLength'] Удаляет столбец
# число непустых строк в DataFrame
#data.count()
#fantasy_zip = zipfile.ZipFile('D:\\Работа\\2_DataS\\yob\\test\\names.zip')
#fantasy_zip.extractall('D:\\Работа\\2_DataS\\yob\\test')
#fantasy_zip.close()

