import pandas as pd
#-------------------------------------------------------------------------------------------
#СТАНДАРТНОЕ ЧТЕНИЕ И ЗАПИСЬ В ФАЙЛ
#-------------------------------------------------------------------------------------------
print(open ('D:\\Работа\\2_DataS\\yob\\yob2015.txt','r').readlines()[:5] )#Прочесть первые 5 строк файла
f = open('poem.txt', 'w') # открываем для записи (writing)
f.write(poem) # записываем текст в файл
f.close() # закрываем файл
f = open('poem.txt') # если не указан режим, по умолчанию подразумевается
#-------------------------------------------------------------------------------------------
# Безопасная запись в текстовый файл
#-------------------------------------------------------------------------------------------
with open(prefix + 'text.txt', 'w') as txt_file:
    print(numbers, file=txt_file)
#-------------------------------------------------------------------------------------------
# Запись в бинарный файл
#-------------------------------------------------------------------------------------------
binary_filename = prefix + 'binary.bin'
with open(binary_filename, 'wb') as bin_file:
    bin_file.write(numbers_array)

